import 'package:dhonkolhu/src/model/section.dart';

class Db {
  static final List<Sections> sections = [
    Sections(
      section: 'ފެށުން',
      topics: [
        {
          'ތަޢާރަފް': <String>{
            "ދޮންކޮޅު އެޕައް މަރުޙަބާ، އަދި ކުރިޔަށް އޮތް އުފާވެރި ދުވަސްތަކަށް ތިޔަފަރާތަށް ހޫނު މަރުޙަބާއެއްކިޔަން. އަލަތުމައިންނަށާއި އަދި ހުރިހާމައިންބަފައިންނަށް، ދޮންކޮޅުއެޕްއަކީ ދަރިފުޅުގެ އެންމެ ނާޒުކުތުއްތު ދުވަސް ވަރުކަމުގައިވާ ފުރަތަމަ 1 އަހަރު ލޯބިން އަޅާލުންދޭނެ ރަންގަޅު ގޮތްތަކެއް ދަސްވެގެންދާނެ އެޕެކެވެ. ދަރިފުޅަށް ފުރަތަމަ 1 އަހަރުތެރޭ ދިމާވާނެ އަދި ދިމާވެދާނެ އެތަކެއްކަހަލަ ކަންކަމަށް އަލިއަޅުވާލާފައިވާނެއެވެ",
            "މަޔަކު ދަރިފުޅުބަލާބޮޑުކުރުމުގައި އަދި ހާއްސަކޮށް ފުރަތަމަ ފަހަރުކަމުގައިވާނަމަ އެރާސްތާއަކީ އެތަކެށްކަހަލަ ގިނަބޮޑެތި ގޮންޖެހުންތަކާއި ކުރިމަތިލާންޖެހޭރާސްތާއެކެވެ. މި އެޕްގައި ހިމަނާލެވިފައިވާ މާއްދާތަކަކީ އެތަކެއްގިނަ މަންމައިންގެ އަދި އާއިލާތަކުގެ ތަޖުރިބާއާއި އަދި ކަމާބެހޭ ޙާއްސަ މާހިރުންގެލަފައާއި އެއްގޮތަށް ތައްޔާރުކެރެވިފައިވާ މާއްދާތަކެކެވެ. 4 މާއްދާއަކަށް އަލިއަޅުވާލައިފާވާއިރު ކޮންމެ މާއްދާއެއްގައި އިތުރު 4 ވަރަށްމުހިންމު ނުކުތާއަކަށްބެހިގެންދާނެއެވެ",
          },
          'Ehenihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ފުރަތަމަ މަސް: ކެއުމާ، ނިދުމާ އަދި ހެދިބޮޑުވުން":
              <String>{},
          'Ehenheihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ދެވަނަ މަސް: ކަންތައްތަށް އިގެން ފެށުން": <String>{},
          'Ehenihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ތިނޮވަނަ މަސް: އުސޫލަކަށް ކަންކުރުމާއި ހެދި ބޮޑުވުން":
              <String>{},
          'Ehenihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ތިނޮވަނަ މަސް: އުސޫލަކަށް ކަންކުރުމާއި ހެދި ބޮޑުވުން":
              <String>{},
          'Ehenihen': <String>{},
        },
      ],
    ),
    Sections(
      section: 'ފެށުން',
      topics: [
        {
          'Thaarafu': <String>{},
          'Ehenihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ފުރަތަމަ މަސް: ކެއުމާ، ނިދުމާ އަދި ހެދިބޮޑުވުން":
              <String>{},
          'Ehenheihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ދެވަނަ މަސް: ކަންތައްތަށް އިގެން ފެށުން": <String>{},
          'Ehenihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ތިނޮވަނަ މަސް: އުސޫލަކަށް ކަންކުރުމާއި ހެދި ބޮޑުވުން":
              <String>{},
          'Ehenihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ތިނޮވަނަ މަސް: އުސޫލަކަށް ކަންކުރުމާއި ހެދި ބޮޑުވުން":
              <String>{},
          'Ehenihen': <String>{},
        },
      ],
    ),
    Sections(
      section: 'ފެށުން',
      topics: [
        {
          'Thaarafu': <String>{},
          'Ehenihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ފުރަތަމަ މަސް: ކެއުމާ، ނިދުމާ އަދި ހެދިބޮޑުވުން":
              <String>{},
          'Ehenheihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ދެވަނަ މަސް: ކަންތައްތަށް އިގެން ފެށުން": <String>{},
          'Ehenihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ތިނޮވަނަ މަސް: އުސޫލަކަށް ކަންކުރުމާއި ހެދި ބޮޑުވުން":
              <String>{},
          'Ehenihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ތިނޮވަނަ މަސް: އުސޫލަކަށް ކަންކުރުމާއި ހެދި ބޮޑުވުން":
              <String>{},
          'Ehenihen': <String>{},
        },
      ],
    ),
    Sections(
      section: 'ފެށުން',
      topics: [
        {
          'Thaarafu': <String>{},
          'Ehenihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ފުރަތަމަ މަސް: ކެއުމާ، ނިދުމާ އަދި ހެދިބޮޑުވުން":
              <String>{},
          'Ehenheihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ދެވަނަ މަސް: ކަންތައްތަށް އިގެން ފެށުން": <String>{},
          'Ehenihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ތިނޮވަނަ މަސް: އުސޫލަކަށް ކަންކުރުމާއި ހެދި ބޮޑުވުން":
              <String>{},
          'Ehenihen': <String>{},
        },
        {
          "ދަރިފުޅުގެ ތިނޮވަނަ މަސް: އުސޫލަކަށް ކަންކުރުމާއި ހެދި ބޮޑުވުން":
              <String>{},
          'Ehenihen': <String>{},
        },
      ],
    ),
  ];
}
